Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
{
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getEntryTypes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetEntryTypesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetFilteringTerms will be created
  + resource "aws_lambda_permission" "APIGetFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getFilteringTerms"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetInfo will be created
  + resource "aws_lambda_permission" "APIGetInfo" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetInfoInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetProjects will be created
  + resource "aws_lambda_permission" "APIGetProjects" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getProjects"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetProjectsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetinfo-root will be created
  + resource "aws_lambda_permission" "APIGetinfo-root" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetinfoRootInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetmap will be created
  + resource "aws_lambda_permission" "APIGetmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getMap"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetMapInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIadmin_proxy will be created
  + resource "aws_lambda_permission" "APIadmin_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-admin"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIadmin_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalyses will be created
  + resource "aws_lambda_permission" "APIanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIanalysesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesId will be created
  + resource "aws_lambda_permission" "APIanalysesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants will be created
  + resource "aws_lambda_permission" "APIanalysesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIanalysesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamples will be created
  + resource "aws_lambda_permission" "APIbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIbiosamplesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesId will be created
  + resource "aws_lambda_permission" "APIbiosamplesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIbiosamplesIdrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasets will be created
  + resource "aws_lambda_permission" "APIdatasets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIdatasetsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsId will be created
  + resource "aws_lambda_permission" "APIdatasetsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIdatasetsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms will be created
  + resource "aws_lambda_permission" "APIdatasetsIdfiltering_terms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdfiltering_termsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants will be created
  + resource "aws_lambda_permission" "APIdatasetsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals will be created
  + resource "aws_lambda_permission" "APIdatasetsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdatasetsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdportal_proxy will be created
  + resource "aws_lambda_permission" "APIdportal_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-dataPortal"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIdportal_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variants will be created
  + resource "aws_lambda_permission" "APIg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsId will be created
  + resource "aws_lambda_permission" "APIg_variantsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIg_variantsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals will be created
  + resource "aws_lambda_permission" "APIg_variantsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIg_variantsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividuals will be created
  + resource "aws_lambda_permission" "APIindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIindividualsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsId will be created
  + resource "aws_lambda_permission" "APIindividualsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIindividualsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants will be created
  + resource "aws_lambda_permission" "APIindividualsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIindividualsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIruns will be created
  + resource "aws_lambda_permission" "APIruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIrunsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsId will be created
  + resource "aws_lambda_permission" "APIrunsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdanalyses will be created
  + resource "aws_lambda_permission" "APIrunsIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdg_variants will be created
  + resource "aws_lambda_permission" "APIrunsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIrunsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles will be created
  + resource "aws_lambda_permission" "S3deidentifyFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3deidentifyFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles will be created
  + resource "aws_lambda_permission" "S3updateFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowS3updateFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSperformQuery will be created
  + resource "aws_lambda_permission" "SNSperformQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSperformQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSsplitQuery will be created
  + resource "aws_lambda_permission" "SNSsplitQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSsplitQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be created
  + resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-dataportal-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-lambda-layers-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be created
  + resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "gaspi-variants-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers will be created
  + resource "aws_s3_bucket_acl" "lambda-layers" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata will be created
  + resource "aws_s3_bucket_acl" "metadata" {
      + acl    = "private"
      + bucket = "gaspi-metadata-20250725085316769800000002"
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + access_control_policy (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
              + "x-amz-abort-date",
              + "x-amz-multipart-parts-count",
            ]
            id              = null
          + max_age_seconds = 36000
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket will be created
  + resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      + bucket = "gaspi-metadata-20250725085316769800000002"
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      + bucket                                 = "gaspi-metadata-20250725085316769800000002"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-3"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-query-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-results/"
            }
        }
      + rule {
          + id     = "clean-old-cached-results"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 2
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "query-responses/"
            }
        }
      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-3"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "remove-zombie-staging-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 3
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "staging/"
            }
        }
      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "staging/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-3"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "clean-old-queries"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "variant-queries/"
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be created
  + resource "aws_s3_bucket_notification" "updateFiles" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)
      + region      = "ap-southeast-3"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + filter_prefix       = "projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "staging/projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      + bucket = "gaspi-metadata-20250725085316769800000002"
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket will be created
  + resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sbeacon.aws_s3_bucket_versioning.metadata-bucket will be created
  + resource "aws_s3_bucket_versioning" "metadata-bucket" {
      + bucket = "gaspi-metadata-20250725085316769800000002"
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be created
  + resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clone-gaspi-notebooks"
      + on_create = (known after apply)
      + on_start  = (known after apply)
      + region    = "ap-southeast-3"
      + tags_all  = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.aws_sns_topic.performQuery will be created
  + resource "aws_sns_topic" "performQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "performQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be created
  + resource "aws_sns_topic" "splitQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "splitQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.performQuery will be created
  + resource "aws_sns_topic_subscription" "performQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.splitQuery will be created
  + resource "aws_sns_topic_subscription" "splitQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.null_resource.init_script will be created
  + resource "null_resource" "init_script" {
      + id       = (known after apply)
      + triggers = {
          + "script_hash" = "bbc03975f95f05b59dedd9be2e829038e1191f06"
        }
    }

  # module.security.aws_cloudwatch_event_rule.gaspi-inspector-findings[0] will be created
  + resource "aws_cloudwatch_event_rule" "gaspi-inspector-findings" {
      + arn            = (known after apply)
      + description    = "Triggers on new Amazon Inspector Findings"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Inspector2 Finding",
                ]
              + source      = [
                  + "aws.inspector2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "gaspi-inspector-findings"
      + name_prefix    = (known after apply)
      + region         = "ap-southeast-3"
      + tags_all       = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }
    }

  # module.security.aws_cloudwatch_event_target.gaspi-inspector-findings[0] will be created
  + resource "aws_cloudwatch_event_target" "gaspi-inspector-findings" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-southeast-3"
      + rule           = "gaspi-inspector-findings"
      + target_id      = (known after apply)
    }

  # module.security.aws_inspector2_enabler.gaspi-inspector-enabler[0] will be created
  + resource "aws_inspector2_enabler" "gaspi-inspector-enabler" {
      + account_ids    = [
          + "209479276142",
        ]
      + id             = (known after apply)
      + region         = "ap-southeast-3"
      + resource_types = [
          + "ECR",
          + "LAMBDA",
        ]
    }

  # module.security.aws_lambda_permission.inspectorFindingLambdaTrigger[0] will be created
  + resource "aws_lambda_permission" "inspectorFindingLambdaTrigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SecurityAllowInspectorFindingLambdaTriggerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be created
  + resource "aws_wafv2_web_acl" "security-all-cloudfront" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF to be applied to all cloudfront distributions"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "security-all-cloudfront"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + scope                       = "CLOUDFRONT"
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "GXC"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "security-all-cloudfront-IP-rate-limiting"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-IP-rate-limiting-rule-metric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "security-all-cloudfront-common-ruleset"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)

                  + rule_action_override {
                      + name = "SizeRestrictions_BODY"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-common-ruleset-rule-metric"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "security-all-cloudfront-metric"
          + sampled_requests_enabled   = true
        }
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = (known after apply)
          + "api_endpoint_sbeacon"    = (known after apply)
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "pgxflow"
          + "clinic_warning_dp"       = "10"
          + "clinic_warning_filter"   = "PASS"
          + "clinic_warning_gq"       = "15"
          + "clinic_warning_mq"       = "30"
          + "clinic_warning_qd"       = "20"
          + "clinic_warning_qual"     = "20"
          + "data_portal_bucket"      = (known after apply)
          + "hub_name"                = "RSJPD"
          + "identity_pool_id"        = (known after apply)
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = (known after apply)
          + "user_pool_web_client_id" = (known after apply)
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be created
  + resource "aws_cloudfront_distribution" "bui-s3-distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Distribution for BeaconUI"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2and3"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + tags_all                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "webgui-s3-origin-id"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "webgui-s3-origin-id"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.webgui.aws_cloudfront_origin_access_control.bui-s3-distribution will be created
  + resource "aws_cloudfront_origin_access_control" "bui-s3-distribution" {
      + arn                               = (known after apply)
      + description                       = "Policy for BeaconUI"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "webgui-access-control"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be created
  + resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "bui-security-headers-policy"

      + custom_headers_config {
          + items {
              + header   = "Permissions-Policy"
              + override = true
              + value    = "geolocation=(), microphone=(), camera=(), payment=(), accelerometer=(), fullscreen=*"
            }
        }

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = (known after apply)
              + override                = true
            }
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "no-referrer"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # module.webgui.aws_s3_bucket.bui-hosted-bucket will be created
  + resource "aws_s3_bucket" "bui-hosted-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "webgui-bucket-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be created
  + resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-southeast-3"
    }

  # module.webgui.aws_s3_object.version will be created
  + resource "aws_s3_object" "version" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = "v1.2.1-60-g9c875c44+"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "version.txt"
      + kms_key_id             = (known after apply)
      + region                 = "ap-southeast-3"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + version_id             = (known after apply)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be created
  + resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "bui-ssm-beacon-ui-url"
      + region         = "ap-southeast-3"
      + tags           = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + tags_all       = {
          + "Environment" = "STAGING"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "GXC"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "caab493802eac5ae99fb1979ad045b4f3c946757"
          + "compiled_code_hash" = (known after apply)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be created
  + resource "terraform_data" "cloudfront-version-invalidate" {
      + id               = (known after apply)
      + triggers_replace = [
          + "v1.2.1-60-g9c875c44+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cognito-customMessageLambdaTrigger"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "GXC"
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_r
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.